Revit 2026 API

# UVIsUnitLength Method

---

The boolean value indicates whether this 2-D vector is of unit length.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsUnitLength()
```
```vb
Public Function IsUnitLength As Boolean
```
```cpp
public:
bool IsUnitLength()
```
```fsharp
member IsUnitLength : unit -> bool
```

#### Return Value

Boolean

A unit length vector has a length of one, and is considered normalized.

#### Reference

UV Class

Autodesk.Revit.DB Namespace